tutorials/pimpleFoam/t-junction/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;           // 5% turbulence
        value           uniform 1;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
